app/controllers/artists_controller.rb

  def show
    #@artist = Artist.find(params[:id])
    if Artist.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def edit
    @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]